Revit 2027 API
OptionalFunctionalityUtils.IsDWFExportAvailable Method
 Checks whether the DWF/DWFx Export functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsDWFExportAvailable()
Public Shared Function IsDWFExportAvailable As Boolean
public:
static bool IsDWFExportAvailable()
static member IsDWFExportAvailable : unit -> bool
Return Value
Boolean
 True if the DWF/DWFx Export functionality is available in the installed Revit.
Remarks
 DWF/DWFx Export requires presence of certain modules that are optional and may not be part of the installed Revit.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace